index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: X11 Configuration Files
#+date: <2024-03-12 Tue>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.2 (Org mode 9.6.15)
#+cite_export:
#+startup: indent fold
#+export_file_name: index.html
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>

* About
* Xprofile
** .xprofile
:PROPERTIES:
:header-args: :tangle .xprofile :shebang #!/bin/sh
:END:

This file (and also =/etc/xprofile= if exists) will be executed at the beginning of X user session, before the window manager starts.
#+begin_src sh -n
  # ~/.xprofile
  # user X session startup file.
  # <alexforsale@yahoo.com>

  if [ -d "${HOME}/.config/xprofile.d" ]; then
      for xfiles in "${HOME}"/.config/xprofile.d/*.sh; do
          # shellcheck disable=1090
          . "${xfiles}"
      done
      unset xfiles
  fi

  # set XDG_SESSION_TYPE here making sure it's points to x11
  if [ -n "${XDG_SESSION_TYPE}" ] || [ "${XDG_SESSION_TYPE}" != "x11" ]; then
      export XDG_SESSION_TYPE="x11"
  fi

  # shellcheck disable=1091
  [ -f "${XDG_CONFIG_HOME}"/xprofile.local ] && . "${XDG_CONFIG_HOME}"/xprofile.local
  # shellcheck disable=1091
  [ -f "${HOME}"/.xprofile.local ] && . "${HOME}"/.xprofile.local
#+end_src
*** Modules
