index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-04 Mon 13:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>X11 Configuration Files</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">X11 Configuration Files</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga9a175d">About</a></li>
<li><a href="#org457e8f0">Xprofile</a>
<ul>
<li><a href="#orgfc1eeef">.xprofile</a></li>
</ul>
</li>
<li><a href="#org438fbec">Xinit</a>
<ul>
<li><a href="#org7fb6f20">.xinitrc</a></li>
</ul>
</li>
<li><a href="#org1af4732">Xresources</a>
<ul>
<li><a href="#orgc6127a5">.Xresouces</a></li>
<li><a href="#org60365f9">Modules</a>
<ul>
<li><a href="#orge00ccae">xterm</a></li>
<li><a href="#org9c10606">URxvt</a></li>
<li><a href="#orgae9232f">x11-ssh-askpass</a></li>
<li><a href="#orgb312c47">xcalc</a></li>
<li><a href="#org3ba2eb7">xclock</a></li>
<li><a href="#org0aa74ad">xscreensaver</a></li>
<li><a href="#org8097dc6">colors</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org16f9375">Xsettingsd</a></li>
<li><a href="#orgcac5e11">Scripts</a>
<ul>
<li><a href="#org90a97dc">monitor-setup</a></li>
<li><a href="#orgd7d08b7">showclip</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga9a175d" class="outline-2">
<h2 id="orga9a175d">About</h2>
</div>
<div id="outline-container-org457e8f0" class="outline-2">
<h2 id="org457e8f0">Xprofile</h2>
<div class="outline-text-2" id="text-org457e8f0">
</div>
<div id="outline-container-orgfc1eeef" class="outline-3">
<h3 id="orgfc1eeef">.xprofile</h3>
<div class="outline-text-3" id="text-orgfc1eeef">
<p>
This file (and also <code>/etc/xprofile</code> if exists) will be executed at the beginning of X user session, before the window manager starts.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.xprofile
<span class="linenr"> 2: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">user X session startup file.
<span class="linenr"> 3: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
<span class="linenr"> 4: </span></span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.config/xprofile.d"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    <span style="color: #4169e1;">for</span> xfiles<span style="color: #4169e1;"> in</span> <span style="color: #bc8f8f;">"${HOME}"</span>/.config/xprofile.d/*.sh; <span style="color: #4169e1;">do</span>
<span class="linenr"> 7: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1090
<span class="linenr"> 8: </span></span>        <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${xfiles}"</span>
<span class="linenr"> 9: </span>    <span style="color: #4169e1;">done</span>
<span class="linenr">10: </span>    <span style="color: #00008b;">unset</span> xfiles
<span class="linenr">11: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">set XDG_SESSION_TYPE here making sure it's points to x11
<span class="linenr">14: </span></span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${XDG_SESSION_TYPE}"</span> ] || [ <span style="color: #bc8f8f;">"${XDG_SESSION_TYPE}"</span> != <span style="color: #bc8f8f;">"x11"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">15: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_SESSION_TYPE</span>=<span style="color: #bc8f8f;">"x11"</span>
<span class="linenr">16: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1091
<span class="linenr">19: </span></span>[ -f <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/xprofile.local ] &amp;&amp; <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/xprofile.local
<span class="linenr">20: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1091
<span class="linenr">21: </span></span>[ -f <span style="color: #bc8f8f;">"${HOME}"</span>/.xprofile.local ] &amp;&amp; <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${HOME}"</span>/.xprofile.local
</pre>
</div>
</div>
<ul class="org-ul">
