index.org
**** 00-security.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/00-security.sh :shebang #!/bin/sh :mkdirp t
:END:

This script will set up any security-related environment variables, start various programs and /dbus/-related settings.
#+begin_src sh -n
  # various ui-related security settings
  # <alexforsale@yahoo.com>

  if [ "$(command -v gnome-keyring-daemon)" ] &&
         [ ! $(pgrep -u ${USER} -x gnome-keyring-d) ];then
      eval "$(gnome-keyring-daemon --start --components=pkcs11,secrets,ssh)" >/dev/null 2>&1
      export SSH_AUTH_SOCK GNOME_KEYRING_CONTROL
  fi
  case "${DISTRO}" in
      gentoo)
          [ -f /usr/bin/x11-ssh-askpass ] &&
              export SSH_ASKPASS=/usr/bin/x11-ssh-askpass &&
              export SUDO_ASKPASS=/usr/bin/x11-ssh-askpass

          # polkit
          if [ ! "$(pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1)" ];then
              sleep 1 && /usr/libexec/polkit-kde-authentication-agent-1 &
          fi
          ;;
      arch)
          if [ -f /usr/lib/ssh/x11-ssh-askpass ];then
              [ ! -L ~/.local/bin/ssh-askpass ] &&
                  ln -sf /usr/lib/ssh/x11-ssh-askpass ~/.local/bin/ssh-askpass
              export SSH_ASKPASS=ssh-askpass
              export SUDO_ASKPASS="${HOME}"/.local/bin/ssh-askpass
          fi
          # polkit
          if [ ! "$(pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1)" ];then
              sleep 1 && /usr/lib/polkit-kde-authentication-agent-1 &
          fi

          # keyring
          [ "$(command -v dbus-update-activation-environment)" ] &&
              dbus-update-activation-environment --systemd DISPLAY
          ;;
      freebsd)
          [ -f /usr/local/bin/x11-ssh-askpass  ] &&
              export SSH_ASKPASS=/usr/local/bin/x11-ssh-askpass &&
              export SUDO_ASKPASS=/usr/local/bin/x11-ssh-askpass

          # polkit
          if [ ! "$(pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1)" ];then
              sleep 1 && /usr/local/libexec/polkit-kde-authentication-agent-1 &
          fi
              
          # keyring
          [ "$(command -v dbus-update-activation-environment)" ] &&
              dbus-update-activation-environment DISPLAY
          ;;
  esac
#+end_src
**** 01-gtk-path.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/01-gtk-path.sh :shebang #!/bin/sh
:END:

Most /GTK/ settings uses the =gsetting= command, but some application still uses environment variable when looking for /GTK/ theme. And for /GTK-2.0/, sets the configuration to the ~/.config/~ directory.
#+begin_src sh -n
  # ~/.config/xprofile.d/01-gtk-path.sh
  # set new location for GTK and GTK2
  # https://wiki.archlinux.org/title/XDG_Base_Directory
  # <alexforsale@yahoo.com>

  export GTK_RC_FILES="${XDG_CONFIG_HOME}"/gtk-1.0/gtkrc
  [ -d "${GTK_RC_FILES%%/gtkrc}" ] && mkdir -p "${GTK_RC_FILES%%/gtkrc}"
  export GTK2_RC_FILES="${XDG_CONFIG_HOME}"/gtk-2.0/gtkrc
  [ -d "${GTK2_RC_FILES%%/gtkrc}" ] && mkdir -p "${GTK2_RC_FILES%%/gtkrc}"

  [ -z "${GTK_THEME}" ] && export GTK_THEME=Breeze-Dark
#+end_src
**** 02-notification.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/02-notification.sh :shebang #!/bin/sh
:END:

For most distribution that uses /systemd/, to avoid race with dbus. For those who doesn't, it should be set in their own init.
#+begin_src sh -n
  # ~/.config/xprofile.d/02-notification.sh
  # notification settings
  # <alexforsale@yahoo.com>

  # dunst
  if [ "$(command -v dunst)" ];then
      case "${DISTRO}" in
          arch)
              case "$(systemctl --user is-active dunst)" in
                  "inactive")
                      [ -n "${DISPLAY}" ] && systemctl --user start dunst
                      ;;
                  "active")
                      # Restart if active
                      [ -n "${DISPLAY}" ] && systemctl --user restart dunst
                      ;;
              esac
              ;;
      esac
  fi
#+end_src
