index.html
<li><a id="orgf58e1a2"></a>Modules<br />
<ul class="org-ul">
<li><a id="org659f3cf"></a>00-security.sh<br />
<div class="outline-text-6" id="text-org659f3cf">
<p>
This script will set up any security-related environment variables, start various programs and <i>dbus</i>-related settings.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">various ui-related security settings
<span class="linenr"> 2: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
<span class="linenr"> 3: </span></span>
<span class="linenr"> 4: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v gnome-keyring-daemon</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp;
<span class="linenr"> 5: </span>       [ ! $(<span style="font-weight: bold;">pgrep -u ${USER} -x gnome-keyring-d</span>) ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    <span style="color: #00008b;">eval</span> <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">gnome-keyring-daemon --start --components=pkcs11,secrets,ssh</span><span style="color: #bc8f8f;">)"</span> &gt;/dev/null 2&gt;&amp;1
<span class="linenr"> 7: </span>    <span style="color: #00008b;">export</span> SSH_AUTH_SOCK GNOME_KEYRING_CONTROL
<span class="linenr"> 8: </span><span style="color: #4169e1;">fi</span>
<span class="linenr"> 9: </span><span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"${DISTRO}"</span><span style="color: #4169e1;"> in</span>
<span class="linenr">10: </span>    gentoo)
<span class="linenr">11: </span>        [ -f /usr/bin/x11-ssh-askpass ] &amp;&amp;
<span class="linenr">12: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=/usr/bin/x11-ssh-askpass &amp;&amp;
<span class="linenr">13: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=/usr/bin/x11-ssh-askpass
<span class="linenr">14: </span>
<span class="linenr">15: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">polkit
<span class="linenr">16: </span></span>        <span style="color: #4169e1;">if</span> [ ! <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1</span><span style="color: #bc8f8f;">)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr">17: </span>            sleep 1 &amp;&amp; /usr/libexec/polkit-kde-authentication-agent-1 &amp;
<span class="linenr">18: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">19: </span>        ;;
<span class="linenr">20: </span>    arch)
<span class="linenr">21: </span>        <span style="color: #4169e1;">if</span> [ -f /usr/lib/ssh/x11-ssh-askpass ];<span style="color: #4169e1;">then</span>
<span class="linenr">22: </span>            [ ! -L ~/.local/bin/ssh-askpass ] &amp;&amp;
<span class="linenr">23: </span>                ln -sf /usr/lib/ssh/x11-ssh-askpass ~/.local/bin/ssh-askpass
<span class="linenr">24: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=ssh-askpass
<span class="linenr">25: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=<span style="color: #bc8f8f;">"${HOME}"</span>/.local/bin/ssh-askpass
<span class="linenr">26: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">27: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">polkit
<span class="linenr">28: </span></span>        <span style="color: #4169e1;">if</span> [ ! <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1</span><span style="color: #bc8f8f;">)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr">29: </span>            sleep 1 &amp;&amp; /usr/lib/polkit-kde-authentication-agent-1 &amp;
<span class="linenr">30: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">31: </span>
<span class="linenr">32: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">keyring
<span class="linenr">33: </span></span>        [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v dbus-update-activation-environment</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp;
<span class="linenr">34: </span>            dbus-update-activation-environment --systemd DISPLAY
<span class="linenr">35: </span>        ;;
<span class="linenr">36: </span>    freebsd)
<span class="linenr">37: </span>        [ -f /usr/local/bin/x11-ssh-askpass  ] &amp;&amp;
<span class="linenr">38: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=/usr/local/bin/x11-ssh-askpass &amp;&amp;
<span class="linenr">39: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=/usr/local/bin/x11-ssh-askpass
<span class="linenr">40: </span>
<span class="linenr">41: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">polkit
<span class="linenr">42: </span></span>        <span style="color: #4169e1;">if</span> [ ! <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">pgrep -f -u ${USER} -x polkit-kde-authentication-agent-1</span><span style="color: #bc8f8f;">)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr">43: </span>            sleep 1 &amp;&amp; /usr/local/libexec/polkit-kde-authentication-agent-1 &amp;
<span class="linenr">44: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">45: </span>
<span class="linenr">46: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">keyring
<span class="linenr">47: </span></span>        [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v dbus-update-activation-environment</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp;
<span class="linenr">48: </span>            dbus-update-activation-environment DISPLAY
<span class="linenr">49: </span>        ;;
<span class="linenr">50: </span><span style="color: #4169e1;">esac</span>
</pre>
</div>
</div>
</li>
<li><a id="org4e73671"></a>01-gtk-path.sh<br />
<div class="outline-text-6" id="text-org4e73671">
<p>
Most <i>GTK</i> settings uses the <code>gsetting</code> command, but some application still uses environment variable when looking for <i>GTK</i> theme. And for <i>GTK-2.0</i>, sets the configuration to the <code>/.config/</code> directory.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/xprofile.d/01-gtk-path.sh
<span class="linenr"> 2: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">set new location for GTK and GTK2
<span class="linenr"> 3: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">https://wiki.archlinux.org/title/XDG_Base_Directory
<span class="linenr"> 4: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
<span class="linenr"> 5: </span></span>
<span class="linenr"> 6: </span><span style="color: #00008b;">export</span> <span style="color: #b8860b;">GTK_RC_FILES</span>=<span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/gtk-1.0/gtkrc
<span class="linenr"> 7: </span>[ -d <span style="color: #bc8f8f;">"${GTK_RC_FILES%%/gtkrc}"</span> ] &amp;&amp; mkdir -p <span style="color: #bc8f8f;">"${GTK_RC_FILES%%/gtkrc}"</span>
<span class="linenr"> 8: </span><span style="color: #00008b;">export</span> <span style="color: #b8860b;">GTK2_RC_FILES</span>=<span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/gtk-2.0/gtkrc
<span class="linenr"> 9: </span>[ -d <span style="color: #bc8f8f;">"${GTK2_RC_FILES%%/gtkrc}"</span> ] &amp;&amp; mkdir -p <span style="color: #bc8f8f;">"${GTK2_RC_FILES%%/gtkrc}"</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>[ -z <span style="color: #bc8f8f;">"${GTK_THEME}"</span> ] &amp;&amp; <span style="color: #00008b;">export</span> <span style="color: #b8860b;">GTK_THEME</span>=Breeze-Dark
</pre>
</div>
</div>
</li>
<li><a id="orgab0a51b"></a>02-notification.sh<br />
<div class="outline-text-6" id="text-orgab0a51b">
<p>
For most distribution that uses <i>systemd</i>, to avoid race with dbus. For those who doesn't, it should be set in their own init.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/xprofile.d/02-notification.sh
<span class="linenr"> 2: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">notification settings
<span class="linenr"> 3: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
<span class="linenr"> 4: </span></span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">dunst
<span class="linenr"> 6: </span></span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v dunst</span><span style="color: #bc8f8f;">)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    <span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"${DISTRO}"</span><span style="color: #4169e1;"> in</span>
<span class="linenr"> 8: </span>        arch)
<span class="linenr"> 9: </span>            <span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">systemctl --user is-active dunst</span><span style="color: #bc8f8f;">)"</span><span style="color: #4169e1;"> in</span>
<span class="linenr">10: </span>                <span style="color: #bc8f8f;">"inactive"</span>)
<span class="linenr">11: </span>                    [ -n <span style="color: #bc8f8f;">"${DISPLAY}"</span> ] &amp;&amp; systemctl --user start dunst
<span class="linenr">12: </span>                    ;;
<span class="linenr">13: </span>                <span style="color: #bc8f8f;">"active"</span>)
<span class="linenr">14: </span>                    <span style="color: #b22222;"># </span><span style="color: #b22222;">Restart if active
<span class="linenr">15: </span></span>                    [ -n <span style="color: #bc8f8f;">"${DISPLAY}"</span> ] &amp;&amp; systemctl --user restart dunst
<span class="linenr">16: </span>                    ;;
<span class="linenr">17: </span>            <span style="color: #4169e1;">esac</span>
<span class="linenr">18: </span>            ;;
<span class="linenr">19: </span>    <span style="color: #4169e1;">esac</span>
<span class="linenr">20: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</li>
