index.org
*** xterm
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/xterm :mkdirp t
:END:

#+begin_src conf -n
  xterm*termName: xterm-256color
  xterm.vt100.geometry: 80x24
  xterm*saveLines: 4096
  xterm*scrollBar: False
  xterm*.LoginShell: True
  xterm*rightScrollBar: False
  xterm*scrollTtyOutput: False
  xterm.selectToClipboard: true
  xterm.*backarrowKey: false
  xterm*translations: #override \
  Ctrl Shift <KeyPress> C: copy-selection(CLIPBOARD) \n\
  Ctrl Shift <KeyPress> V: insert-selection(CLIPBOARD) \n\
  Ctrl <Btn1Up>: exec-formatted("xdg-open '%t'", PRIMARY) \n\
  ~Meta Shift<Key>Tab: string(\033[Z) \n\
  Meta Shift<Key>Tab: string(\033\033[Z) \n\
  Ctrl <Key> minus: smaller-vt-font() \n\
  Ctrl <Key> plus: larger-vt-font() \n\
  Ctrl <Key> 0: set-vt-font(d)
  xterm*eightBitInput: false
  xterm*metaSendsEscape: true
  xterm*charClass: 33:48,37-38:48,45-47:48,64:48,58:48,126:48,61:48,63:48,43:48,35:48
  xterm*renderFont: true
  xterm*faceName: OverpassM Nerd Font Mono
  xterm*faceSize: 8
#+end_src
*** URxvt
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/URxvt
:END:

#+begin_src conf -n
  ! arch package (aur): urxvt-resize-font-git
  URxvt.perl-ext-common: default,tabbed,matcher,resize-font,-tabbed
  URxvt.saveLines: 2000
  URxvt.secondaryScreen: 1
  URxvt.secondaryScroll: 0
  URxvt.scrollBar: False
  URxvt.scrollBar_right: false
  URxvt.scrollBar_floating: false
  URxvt.scrollstyle: rxvt
  URxvt.termName: xterm-256color
  URxvt.cursorBlink: True
  URxvt.secondaryWheel: 1
  URxvt.font: xft:Source\ Code\ Pro:size=8
  URxvt.keysym.C-S-0x43: eval:selection_to_clipboard
  URxvt.keysym.C-S-0x56: eval:paste_clipboard
  URxvt.keysym.C-minus: resize-font:smaller
  URxvt.keysym.C-plus: resize-font:bigger
  URxvt.keysym.C-equal: resize-font:reset
  URxvt.keysym.C-question: resize-font:show
  URxvt.iso14755: false
  URxvt.iso14755_52: false
  URxvt.bell-command: canberra-gtk-play -i bell
  URxvt.loginShell: true
#+end_src
*** x11-ssh-askpass
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/x11-ssh-askpass
:END:

#+begin_src conf -n
  ! -*- eval: (rainbow-mode 1) -*-
  x11-ssh-askpass*background:             #000000
  x11-ssh-askpass*foreground:             #ffffff
  x11-ssh-askpass.Button*background:      #000000
  x11-ssh-askpass.Indicator*foreground:   #ff9900
  x11-ssh-askpass.Indicator*background:   #090909
  x11-ssh-askpass*topShadowColor:         #000000
  x11-ssh-askpass*bottomShadowColor:      #000000
  x11-ssh-askpass.*borderWidth:           1
#+end_src
*** xcalc
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/xcalc
:END:

#+begin_src conf -n
  ! -*- eval: (rainbow-mode 1) -*-
  xcalc*geometry:                        200x275
  xcalc.ti.bevel.background:             #111111
  xcalc.ti.bevel.screen.background:      #000000
  xcalc.ti.bevel.screen.DEG.background:  #000000
  xcalc.ti.bevel.screen.DEG.foreground:  LightSeaGreen
  xcalc.ti.bevel.screen.GRAD.background: #000000
  xcalc.ti.bevel.screen.GRAD.foreground: LightSeaGreen
  xcalc.ti.bevel.screen.RAD.background:  #000000
  xcalc.ti.bevel.screen.RAD.foreground:  LightSeaGreen
  xcalc.ti.bevel.screen.INV.background:  #000000
  xcalc.ti.bevel.screen.INV.foreground:  Red
  xcalc.ti.bevel.screen.LCD.background:  #000000
  xcalc.ti.bevel.screen.LCD.foreground:  LightSeaGreen
  xcalc.ti.bevel.screen.LCD.shadowWidth: 0
  xcalc.ti.bevel.screen.M.background:    #000000
  xcalc.ti.bevel.screen.M.foreground:    LightSeaGreen
  xcalc.ti.bevel.screen.P.background:    #000000
  xcalc.ti.bevel.screen.P.foreground:    Yellow
  xcalc.ti.Command.foreground:  White
  xcalc.ti.Command.background:  #777777
  xcalc.ti.button5.background:  Orange3
  xcalc.ti.button19.background: #611161
  xcalc.ti.button18.background: #611161
  xcalc.ti.button20.background: #611111
  xcalc.ti.button25.background: #722222
  xcalc.ti.button30.background: #833333
  xcalc.ti.button35.background: #944444
  xcalc.ti.button40.background: #a55555
  xcalc.ti.button22.background: #222262
  xcalc.ti.button23.background: #222262
  xcalc.ti.button24.background: #222272
  xcalc.ti.button27.background: #333373
  xcalc.ti.button28.background: #333373
  xcalc.ti.button29.background: #333373
  xcalc.ti.button32.background: #444484
  xcalc.ti.button33.background: #444484
  xcalc.ti.button34.background: #444484
  xcalc.ti.button37.background: #555595
  xcalc.ti.button38.background: #555595
  xcalc.ti.button39.background: #555595
  XCalc*Cursor:                 hand2
  XCalc*ShapeStyle:             rectangle
#+end_src
