index.html
<div id="outline-container-org60365f9" class="outline-3">
<h3 id="org60365f9">Modules</h3>
<div class="outline-text-3" id="text-org60365f9">
</div>
<div id="outline-container-orge00ccae" class="outline-4">
<h4 id="orge00ccae">xterm</h4>
<div class="outline-text-4" id="text-orge00ccae">
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>xterm*termName: xterm-256color
<span class="linenr"> 2: </span>xterm.vt100.geometry: 80x24
<span class="linenr"> 3: </span>xterm*saveLines: 4096
<span class="linenr"> 4: </span>xterm*scrollBar: False
<span class="linenr"> 5: </span>xterm*.LoginShell: True
<span class="linenr"> 6: </span>xterm*rightScrollBar: False
<span class="linenr"> 7: </span>xterm*scrollTtyOutput: False
<span class="linenr"> 8: </span>xterm.selectToClipboard: true
<span class="linenr"> 9: </span>xterm.*backarrowKey: false
<span class="linenr">10: </span>xterm*translations: <span style="color: #b22222;">#</span><span style="color: #b22222;">override \
<span class="linenr">11: </span></span>Ctrl Shift &lt;KeyPress&gt; C: copy-selection(CLIPBOARD) \n\
<span class="linenr">12: </span>Ctrl Shift &lt;KeyPress&gt; V: insert-selection(CLIPBOARD) \n\
<span class="linenr">13: </span>Ctrl &lt;Btn1Up&gt;: exec-formatted(<span style="color: #bc8f8f;">"xdg-open '%t'"</span>, PRIMARY) \n\
<span class="linenr">14: </span>~Meta Shift&lt;Key&gt;Tab: string(\033[Z) \n\
<span class="linenr">15: </span>Meta Shift&lt;Key&gt;Tab: string(\033\033[Z) \n\
<span class="linenr">16: </span>Ctrl &lt;Key&gt; minus: smaller-vt-font() \n\
<span class="linenr">17: </span>Ctrl &lt;Key&gt; plus: larger-vt-font() \n\
<span class="linenr">18: </span>Ctrl &lt;Key&gt; 0: set-vt-font(d)
<span class="linenr">19: </span>xterm*eightBitInput: false
<span class="linenr">20: </span>xterm*metaSendsEscape: true
<span class="linenr">21: </span>xterm*charClass: 33:48,37-38:48,45-47:48,64:48,58:48,126:48,61:48,63:48,43:48,35:48
<span class="linenr">22: </span>xterm*renderFont: true
<span class="linenr">23: </span>xterm*faceName: OverpassM Nerd Font Mono
<span class="linenr">24: </span>xterm*faceSize: 8
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c10606" class="outline-4">
<h4 id="org9c10606">URxvt</h4>
<div class="outline-text-4" id="text-org9c10606">
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>! arch package (aur): urxvt-resize-font-git
<span class="linenr"> 2: </span>URxvt.perl-ext-common: default,tabbed,matcher,resize-font,-tabbed
<span class="linenr"> 3: </span>URxvt.saveLines: 2000
<span class="linenr"> 4: </span>URxvt.secondaryScreen: 1
<span class="linenr"> 5: </span>URxvt.secondaryScroll: 0
<span class="linenr"> 6: </span>URxvt.scrollBar: False
<span class="linenr"> 7: </span>URxvt.scrollBar_right: false
<span class="linenr"> 8: </span>URxvt.scrollBar_floating: false
<span class="linenr"> 9: </span>URxvt.scrollstyle: rxvt
<span class="linenr">10: </span>URxvt.termName: xterm-256color
<span class="linenr">11: </span>URxvt.cursorBlink: True
<span class="linenr">12: </span>URxvt.secondaryWheel: 1
<span class="linenr">13: </span><span style="color: #b8860b;">URxvt.font: xft:Source\ Code\ Pro:size</span>=8
<span class="linenr">14: </span>URxvt.keysym.C-S-0x43: eval:selection_to_clipboard
<span class="linenr">15: </span>URxvt.keysym.C-S-0x56: eval:paste_clipboard
<span class="linenr">16: </span>URxvt.keysym.C-minus: resize-font:smaller
<span class="linenr">17: </span>URxvt.keysym.C-plus: resize-font:bigger
<span class="linenr">18: </span>URxvt.keysym.C-equal: resize-font:reset
<span class="linenr">19: </span>URxvt.keysym.C-question: resize-font:show
<span class="linenr">20: </span>URxvt.iso14755: false
<span class="linenr">21: </span>URxvt.iso14755_52: false
<span class="linenr">22: </span>URxvt.bell-command: canberra-gtk-play -i bell
<span class="linenr">23: </span>URxvt.loginShell: true
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae9232f" class="outline-4">
<h4 id="orgae9232f">x11-ssh-askpass</h4>
<div class="outline-text-4" id="text-orgae9232f">
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr">1: </span>! -*- eval: (rainbow-mode 1) -*-
<span class="linenr">2: </span>x11-ssh-askpass*background:             <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">3: </span></span>x11-ssh-askpass*foreground:             <span style="color: #b22222;">#</span><span style="color: #b22222;">ffffff
<span class="linenr">4: </span></span>x11-ssh-askpass.Button*background:      <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">5: </span></span>x11-ssh-askpass.Indicator*foreground:   <span style="color: #b22222;">#</span><span style="color: #b22222;">ff9900
<span class="linenr">6: </span></span>x11-ssh-askpass.Indicator*background:   <span style="color: #b22222;">#</span><span style="color: #b22222;">090909
<span class="linenr">7: </span></span>x11-ssh-askpass*topShadowColor:         <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">8: </span></span>x11-ssh-askpass*bottomShadowColor:      <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">9: </span></span>x11-ssh-askpass.*borderWidth:           1
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb312c47" class="outline-4">
<h4 id="orgb312c47">xcalc</h4>
<div class="outline-text-4" id="text-orgb312c47">
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>! -*- eval: (rainbow-mode 1) -*-
<span class="linenr"> 2: </span>xcalc*geometry:                        200x275
<span class="linenr"> 3: </span>xcalc.ti.bevel.background:             <span style="color: #b22222;">#</span><span style="color: #b22222;">111111
<span class="linenr"> 4: </span></span>xcalc.ti.bevel.screen.background:      <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr"> 5: </span></span>xcalc.ti.bevel.screen.DEG.background:  <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr"> 6: </span></span>xcalc.ti.bevel.screen.DEG.foreground:  LightSeaGreen
<span class="linenr"> 7: </span>xcalc.ti.bevel.screen.GRAD.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr"> 8: </span></span>xcalc.ti.bevel.screen.GRAD.foreground: LightSeaGreen
<span class="linenr"> 9: </span>xcalc.ti.bevel.screen.RAD.background:  <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">10: </span></span>xcalc.ti.bevel.screen.RAD.foreground:  LightSeaGreen
<span class="linenr">11: </span>xcalc.ti.bevel.screen.INV.background:  <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">12: </span></span>xcalc.ti.bevel.screen.INV.foreground:  Red
<span class="linenr">13: </span>xcalc.ti.bevel.screen.LCD.background:  <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">14: </span></span>xcalc.ti.bevel.screen.LCD.foreground:  LightSeaGreen
<span class="linenr">15: </span>xcalc.ti.bevel.screen.LCD.shadowWidth: 0
<span class="linenr">16: </span>xcalc.ti.bevel.screen.M.background:    <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">17: </span></span>xcalc.ti.bevel.screen.M.foreground:    LightSeaGreen
<span class="linenr">18: </span>xcalc.ti.bevel.screen.P.background:    <span style="color: #b22222;">#</span><span style="color: #b22222;">000000
<span class="linenr">19: </span></span>xcalc.ti.bevel.screen.P.foreground:    Yellow
<span class="linenr">20: </span>xcalc.ti.Command.foreground:  White
<span class="linenr">21: </span>xcalc.ti.Command.background:  <span style="color: #b22222;">#</span><span style="color: #b22222;">777777
<span class="linenr">22: </span></span>xcalc.ti.button5.background:  Orange3
<span class="linenr">23: </span>xcalc.ti.button19.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">611161
<span class="linenr">24: </span></span>xcalc.ti.button18.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">611161
<span class="linenr">25: </span></span>xcalc.ti.button20.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">611111
<span class="linenr">26: </span></span>xcalc.ti.button25.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">722222
<span class="linenr">27: </span></span>xcalc.ti.button30.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">833333
<span class="linenr">28: </span></span>xcalc.ti.button35.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">944444
<span class="linenr">29: </span></span>xcalc.ti.button40.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">a55555
<span class="linenr">30: </span></span>xcalc.ti.button22.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">222262
<span class="linenr">31: </span></span>xcalc.ti.button23.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">222262
<span class="linenr">32: </span></span>xcalc.ti.button24.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">222272
<span class="linenr">33: </span></span>xcalc.ti.button27.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">333373
<span class="linenr">34: </span></span>xcalc.ti.button28.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">333373
<span class="linenr">35: </span></span>xcalc.ti.button29.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">333373
<span class="linenr">36: </span></span>xcalc.ti.button32.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">444484
<span class="linenr">37: </span></span>xcalc.ti.button33.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">444484
<span class="linenr">38: </span></span>xcalc.ti.button34.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">444484
<span class="linenr">39: </span></span>xcalc.ti.button37.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">555595
<span class="linenr">40: </span></span>xcalc.ti.button38.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">555595
<span class="linenr">41: </span></span>xcalc.ti.button39.background: <span style="color: #b22222;">#</span><span style="color: #b22222;">555595
<span class="linenr">42: </span></span>XCalc*Cursor:                 hand2
<span class="linenr">43: </span>XCalc*ShapeStyle:             rectangle
</pre>
</div>
</div>
</div>
