index.org
* Xsettingsd
:PROPERTIES:
:header-args: :tangle .config/xsettingsd/xsettingsd.conf :mkdirp t
:END:

#+begin_src conf -n
  Gtk/CursorThemeName "Bibata-Modern-Classic"
  Gtk/CursorThemeSize 24
  Gtk/EnableAnimations 1
  Gtk/FontName "OverpassM Nerd Font Mono,  12"
  Net/CursorBlink 1
  Net/CursorBlinkTime 1200
  Net/DndDragThreshold 8
  Net/DoubleClickDistance 5
  Net/DoubleClickTime 250
  Net/EnableEventSounds 1
  Net/EnableInputFeedbackSounds 1
  Net/IconThemeName "Papirus"
  Net/SoundThemeName "freedesktop"
  Net/ThemeName "Breeze-dark"
  Xft/Antialias 1
  Xft/DPI -1
  Xft/HintStyle "hintslight"
  Xft/Hinting 1
  Xft/RGBA "rgb"
#+end_src
- =OverpassM Nerd Font Mono= is packaged in =otf-overpass-nerd= which in turns grouped in the =nerd-fonts= package group.
- =Papirus= is in =papirus-icon-theme=.
- =Bibata-Modern-Classic= is from =bibata-cursor-theme=.
- =Breeze-dark= is from =breeze= and for =breeze-gtk= for gtk applications.
* Scripts
** monitor-setup
:PROPERTIES:
:header-args: :tangle .local/bin/monitor-setup :shebang #!/bin/sh :mkdirp t
:END:

#+begin_src sh -n
  if [ "$(command -v hostnamectl)" ]; then
      _HOSTNAME="$(hostnamectl hostname)"
  elif [ -n "${HOSTNAME}" ]; then
      _HOSTNAME="${HOSTNAME}"
  elif [ -f /etc/hostname ]; then
      _HOSTNAME="$(cat /etc/hostname)"
  fi

  case ${_HOSTNAME} in
      liberia*)
          extern=HDMI-2
          intern=eDP-1
          if [ $(xrandr |grep -q "${extern} disconnected") ]; then
              xrandr --output "${extern}" --off output "${intern}" --auto
          else
              xrandr --output "${intern}" --auto --scale 1.25x1.25 --output "${extern}" --auto --left-of "${intern}"
          fi
          xrandr --output "${intern}" --scale 1.25x1.25
          ;;
  esac
#+end_src
** showclip
:PROPERTIES:
:header-args: :tangle .local/bin/showclip :shebang #!/bin/sh :mkdirp t
:END:

This is now replaced by a [[https://github.com/alexforsale/showclip][small Rust program that I wrote]].
#+begin_src sh -n :tangle no
  # Display contents of selection via dunst if running.

  clip=$(xclip -o -selection clipboard)
  prim=$(xclip -o -selection primary)

  [ -n "$clip" ] && notify-send -t 1000 "Clipboard:" "$clip"
  [ -n "$prim" ] && notify-send -t 1000 "Primary:" "$prim"
#+end_src
