index.html
<div id="outline-container-org16f9375" class="outline-2">
<h2 id="org16f9375">Xsettingsd</h2>
<div class="outline-text-2" id="text-org16f9375">
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>Gtk/CursorThemeName <span style="color: #bc8f8f;">"Bibata-Modern-Classic"</span>
<span class="linenr"> 2: </span>Gtk/CursorThemeSize 24
<span class="linenr"> 3: </span>Gtk/EnableAnimations 1
<span class="linenr"> 4: </span>Gtk/FontName <span style="color: #bc8f8f;">"OverpassM Nerd Font Mono,  12"</span>
<span class="linenr"> 5: </span>Net/CursorBlink 1
<span class="linenr"> 6: </span>Net/CursorBlinkTime 1200
<span class="linenr"> 7: </span>Net/DndDragThreshold 8
<span class="linenr"> 8: </span>Net/DoubleClickDistance 5
<span class="linenr"> 9: </span>Net/DoubleClickTime 250
<span class="linenr">10: </span>Net/EnableEventSounds 1
<span class="linenr">11: </span>Net/EnableInputFeedbackSounds 1
<span class="linenr">12: </span>Net/IconThemeName <span style="color: #bc8f8f;">"Papirus"</span>
<span class="linenr">13: </span>Net/SoundThemeName <span style="color: #bc8f8f;">"freedesktop"</span>
<span class="linenr">14: </span>Net/ThemeName <span style="color: #bc8f8f;">"Breeze-dark"</span>
<span class="linenr">15: </span>Xft/Antialias 1
<span class="linenr">16: </span>Xft/DPI -1
<span class="linenr">17: </span>Xft/HintStyle <span style="color: #bc8f8f;">"hintslight"</span>
<span class="linenr">18: </span>Xft/Hinting 1
<span class="linenr">19: </span>Xft/RGBA <span style="color: #bc8f8f;">"rgb"</span>
</pre>
</div>
<ul class="org-ul">
<li><code>OverpassM Nerd Font Mono</code> is packaged in <code>otf-overpass-nerd</code> which in turns grouped in the <code>nerd-fonts</code> package group.</li>
<li><code>Papirus</code> is in <code>papirus-icon-theme</code>.</li>
<li><code>Bibata-Modern-Classic</code> is from <code>bibata-cursor-theme</code>.</li>
<li><code>Breeze-dark</code> is from <code>breeze</code> and for <code>breeze-gtk</code> for gtk applications.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcac5e11" class="outline-2">
<h2 id="orgcac5e11">Scripts</h2>
<div class="outline-text-2" id="text-orgcac5e11">
</div>
<div id="outline-container-org90a97dc" class="outline-3">
<h3 id="org90a97dc">monitor-setup</h3>
<div class="outline-text-3" id="text-org90a97dc">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v hostnamectl</span><span style="color: #bc8f8f;">)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 2: </span>    <span style="color: #b8860b;">_HOSTNAME</span>=<span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">hostnamectl hostname</span><span style="color: #bc8f8f;">)"</span>
<span class="linenr"> 3: </span><span style="color: #4169e1;">elif</span> [ -n <span style="color: #bc8f8f;">"${HOSTNAME}"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 4: </span>    <span style="color: #b8860b;">_HOSTNAME</span>=<span style="color: #bc8f8f;">"${HOSTNAME}"</span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">elif</span> [ -f /etc/hostname ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    <span style="color: #b8860b;">_HOSTNAME</span>=<span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">cat /etc/hostname</span><span style="color: #bc8f8f;">)"</span>
<span class="linenr"> 7: </span><span style="color: #4169e1;">fi</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #4169e1;">case</span> ${<span style="color: #b8860b;">_HOSTNAME</span>} <span style="color: #4169e1;">in</span>
<span class="linenr">10: </span>    liberia*)
<span class="linenr">11: </span>        <span style="color: #b8860b;">extern</span>=HDMI-2
<span class="linenr">12: </span>        <span style="color: #b8860b;">intern</span>=eDP-1
<span class="linenr">13: </span>        <span style="color: #4169e1;">if</span> [ $(<span style="font-weight: bold;">xrandr |grep -q "${extern} disconnected"</span>) ]; <span style="color: #4169e1;">then</span>
<span class="linenr">14: </span>            xrandr --output <span style="color: #bc8f8f;">"${extern}"</span> --off output <span style="color: #bc8f8f;">"${intern}"</span> --auto
<span class="linenr">15: </span>        <span style="color: #4169e1;">else</span>
<span class="linenr">16: </span>            xrandr --output <span style="color: #bc8f8f;">"${intern}"</span> --auto --scale 1.25x1.25 --output <span style="color: #bc8f8f;">"${extern}"</span> --auto --left-of <span style="color: #bc8f8f;">"${intern}"</span>
<span class="linenr">17: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">18: </span>        xrandr --output <span style="color: #bc8f8f;">"${intern}"</span> --scale 1.25x1.25
<span class="linenr">19: </span>        ;;
<span class="linenr">20: </span><span style="color: #4169e1;">esac</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7d08b7" class="outline-3">
<h3 id="orgd7d08b7">showclip</h3>
<div class="outline-text-3" id="text-orgd7d08b7">
<p>
This is now replaced by a <a href="https://github.com/alexforsale/showclip">small Rust program that I wrote</a>.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Display contents of selection via dunst if running.
<span class="linenr">2: </span></span>
<span class="linenr">3: </span><span style="color: #b8860b;">clip</span>=$(<span style="font-weight: bold;">xclip -o -selection clipboard</span>)
<span class="linenr">4: </span><span style="color: #b8860b;">prim</span>=$(<span style="font-weight: bold;">xclip -o -selection primary</span>)
<span class="linenr">5: </span>
<span class="linenr">6: </span>[ -n <span style="color: #bc8f8f;">"$clip"</span> ] &amp;&amp; notify-send -t 1000 <span style="color: #bc8f8f;">"Clipboard:"</span> <span style="color: #bc8f8f;">"$clip"</span>
<span class="linenr">7: </span>[ -n <span style="color: #bc8f8f;">"$prim"</span> ] &amp;&amp; notify-send -t 1000 <span style="color: #bc8f8f;">"Primary:"</span> <span style="color: #bc8f8f;">"$prim"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-12 Tue 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-08-04 Mon 13:52</p>
</div>
</body>
</html>
